BAS BMEKZU Project/src/Reports/КнигаДоходовПоЕдиномуНалогу/КнигаДоходовПоЕдиномуНалогу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КнигаДоходовПоЕдиномуНалогу</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаНарастающегоИтога</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

BAS BMEKZU Project/src/AccumulationRegisters/КнигаДоходовРасходовПоЕдиномуНалогу/КнигаДоходовРасходовПоЕдиномуНалогу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигаДоходовРасходовПоЕдиномуНалогу</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерПлатежногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BAS BMEKZU Project/src/Reports/КнигаДоходовПоЕдиномуНалогу/ManagerModule.bsl
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища, ТабДокумент = Неопределено) Экспорт
	
	ПечатьПолногоОтчета = (ТабДокумент = Неопределено);
	
	Если ПечатьПолногоОтчета Тогда
		ТабДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если ПараметрыОтчета.НачалоПериода >= Дата('20210101') Тогда
		Макет = ПолучитьМакет("UK_Макет2021");
	Иначе
		Макет = ПолучитьМакет("UK_Макет");
	КонецЕсли;
	
	Если ПечатьПолногоОтчета Тогда
		ТабДокумент.Очистить();
		ОбластьМакета    = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета    = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачГода",         ПараметрыОтчета.ДатаНачалаНарастающегоИтога);
	Запрос.УстановитьПараметр("НачКвартала",     Макс(ПараметрыОтчета.ДатаНачалаНарастающегоИтога, НачалоКвартала(ПараметрыОтчета.НачалоПериода)));
	Запрос.УстановитьПараметр("ПередНачПериода", ПараметрыОтчета.НачалоПериода - 1);
	Запрос.УстановитьПараметр("НачПериода",      ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода",      КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",     ПараметрыОтчета.Организация);
	
	Запрос.УстановитьПараметр("СтатьяРеализация",                Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыРеализация);
	Запрос.УстановитьПараметр("СтатьяВозвраты",                  Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыВозвраты);
	Запрос.УстановитьПараметр("СтатьяБезоплатноПолученные",      Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыСтоимостьБезоплатноПолученных);
	Запрос.УстановитьПараметр("СтатьяПросроченнаяЗадолженность", Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыПросроченнаяЗадолженность);
	СписокСтатейПревышений = Новый СписокЗначений;
	СписокСтатейПревышений.Добавить(Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходыПоВидуДеятельностиНеУказанномуВСвидетельстве);
	СписокСтатейПревышений.Добавить(Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходыДругойСпособРасчетов);
	СписокСтатейПревышений.Добавить(Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходыПоВидуДеятельностиНеЕдиныйНалог);
	Запрос.УстановитьПараметр("СписокСтатейПревышений", СписокСтатейПревышений);
	Запрос.УстановитьПараметр("СтатьяДоходы",                    Справочники.СтатьиНалоговыхДеклараций.ЕННК_Доходы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья2, 0) КАК Статья2,
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья3, 0) КАК Статья3,
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья4, 0) КАК Статья4,
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья5, 0) КАК Статья5,
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья6, 0) КАК Статья6,
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья7, 0) КАК Статья7,
	|	ЕСТЬNULL(КнигаДоходовРасходовИтог.Статья9, 0) КАК Статья9,
	|	КнигаДоходовРасходовИтог.ПериодМесяц КАК ПериодМесяц,
	|	КнигаДоходовРасходовИтог.ПериодДень КАК ПериодДень,
	|	КнигаДоходовРасходовИтог.Период,
	|	КнигаДоходовРасходовИтог.Статья
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяРеализация
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья2,
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяВозвраты
	|					ТОГДА -ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья3,
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяРеализация
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяВозвраты
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья4,
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяБезоплатноПолученные
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья5,
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяПросроченнаяЗадолженность
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья6,
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяРеализация
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяВозвраты
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяБезоплатноПолученные
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья = &СтатьяПросроченнаяЗадолженность
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья7,
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаГода.Статья В (&СписокСтатейПревышений)
	|					ТОГДА ОборотСНачалаГода.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК Статья9,
	|		NULL КАК ПериодМесяц,
	|		NULL КАК ПериодДень,
	|		NULL КАК Период,
	|		NULL КАК Статья
	|	ИЗ
	|		РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу.Обороты(&НачГода, &ПередНачПериода, , Организация = &Организация) КАК ОборотСНачалаГода
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяРеализация
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяВозвраты
	|					ТОГДА -ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяРеализация
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяВозвраты
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяБезоплатноПолученные
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяПросроченнаяЗадолженность
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяРеализация
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяВозвраты
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяБезоплатноПолученные
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья = &СтатьяПросроченнаяЗадолженность
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА ОборотСНачалаКвартала.Статья В (&СписокСтатейПревышений)
	|					ТОГДА ОборотСНачалаКвартала.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		NULL,
	|		NULL,
	|		1,
	|		NULL
	|	ИЗ
	|		РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу.Обороты(&НачКвартала, &ПередНачПериода, , Организация = &Организация) КАК ОборотСНачалаКвартала
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяРеализация
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяВозвраты
	|					ТОГДА -КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяРеализация
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяВозвраты
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяБезоплатноПолученные
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяПросроченнаяЗадолженность
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяРеализация
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяВозвраты
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяБезоплатноПолученные
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) + СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья = &СтатьяПросроченнаяЗадолженность
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		СУММА(ВЫБОР
	|				КОГДА КнигаДоходовРасходов.Статья В (&СписокСтатейПревышений)
	|					ТОГДА КнигаДоходовРасходов.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		НАЧАЛОПЕРИОДА(КнигаДоходовРасходов.Период, МЕСЯЦ),
	|		НАЧАЛОПЕРИОДА(КнигаДоходовРасходов.Период, ДЕНЬ),
	|		КнигаДоходовРасходов.Период,
	|		КнигаДоходовРасходов.Статья
	|	ИЗ
	|		РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу КАК КнигаДоходовРасходов
	|	ГДЕ
	|		КнигаДоходовРасходов.Организация = &Организация
	|		И КнигаДоходовРасходов.Статья В ИЕРАРХИИ(&СтатьяДоходы)
	|		И КнигаДоходовРасходов.Период >= &НачПериода
	|		И КнигаДоходовРасходов.Период <= &КонПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(КнигаДоходовРасходов.Период, МЕСЯЦ),
	|		НАЧАЛОПЕРИОДА(КнигаДоходовРасходов.Период, ДЕНЬ),
	|		КнигаДоходовРасходов.Период,
	|		КнигаДоходовРасходов.Статья) КАК КнигаДоходовРасходовИтог
	|
	|УПОРЯДОЧИТЬ ПО
	|	КнигаДоходовРасходовИтог.ПериодМесяц,
	|	КнигаДоходовРасходовИтог.ПериодДень,
	|	КнигаДоходовРасходовИтог.Период
	|ИТОГИ
	|	СУММА(Статья2),
	|	СУММА(Статья3),
	|	СУММА(Статья4),
	|	СУММА(Статья5),
	|	СУММА(Статья6),
	|	СУММА(Статья7),
	|	СУММА(Статья9)
	|ПО
	|	ПериодМесяц,
	|	ПериодДень";
	ВыборкаМесяц = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьСтрока    = Макет.ПолучитьОбласть("Строка");
	ОбластьДень      = Макет.ПолучитьОбласть("День");
	ОбластьМесяц     = Макет.ПолучитьОбласть("Месяц");
	ОбластьКвартал   = Макет.ПолучитьОбласть("Квартал");
	ОбластьГод       = Макет.ПолучитьОбласть("Год");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	ПараметрыСтрока  = ОбластьСтрока.Параметры;
	ПараметрыДень    = ОбластьДень.Параметры;
	ПараметрыМесяц   = ОбластьМесяц.Параметры;
	ПараметрыКвартал = ОбластьКвартал.Параметры;
	ПараметрыГод     = ОбластьГод.Параметры;
	ТекГод           = НачалоГода(ПараметрыОтчета.НачалоПериода);
	ТекКвартал       = НачалоКвартала(ПараметрыОтчета.НачалоПериода);
	
	ТабДокумент.НачатьГруппуСтрок("Год");
	ПараметрыГод.Итого   = "Наростаючим підсумком" + Символы.ПС + "за " + Формат(ТекГод,"ДФ=yyyy") + " рік:";
	
	ТабДокумент.НачатьГруппуСтрок("Квартал");
	ПараметрыКвартал.Итого   = "Наростаючим підсумком" + Символы.ПС + "за "
								+ Формат(ТекКвартал,"ДФ=q") + " квартал "
								+ Формат(ТекКвартал,"ДФ=yyyy") + " року:";
	
	Если ВыборкаМесяц.Следующий() Тогда
									
		ВыборкаДень = ВыборкаМесяц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаДень.Следующий() Тогда
			
			ВыборкаПериоды = ВыборкаДень.Выбрать();
			
			//Получение оборотов с начала года
			Если ВыборкаПериоды.Следующий() Тогда
				
				ПараметрыГод.Статья2 = ВыборкаПериоды.Статья2;
				ПараметрыГод.Статья3 = ВыборкаПериоды.Статья3;
				ПараметрыГод.Статья4 = ВыборкаПериоды.Статья4;
				ПараметрыГод.Статья5 = ВыборкаПериоды.Статья5;
				ПараметрыГод.Статья6 = ВыборкаПериоды.Статья6;
				ПараметрыГод.Статья7 = ВыборкаПериоды.Статья7;
				ПараметрыГод.Статья9 = ВыборкаПериоды.Статья9;
				
			КонецЕсли;
			
			//Получение оборотов с начала квартала
			Если ВыборкаПериоды.Следующий() Тогда
				
				ПараметрыКвартал.Статья2 = ВыборкаПериоды.Статья2;
				ПараметрыКвартал.Статья3 = ВыборкаПериоды.Статья3;
				ПараметрыКвартал.Статья4 = ВыборкаПериоды.Статья4;
				ПараметрыКвартал.Статья5 = ВыборкаПериоды.Статья5;
				ПараметрыКвартал.Статья6 = ВыборкаПериоды.Статья6;
				ПараметрыКвартал.Статья7 = ВыборкаПериоды.Статья7;
				ПараметрыКвартал.Статья9 = ВыборкаПериоды.Статья9;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Начало = Истина;
	
	Пока ВыборкаМесяц.Следующий() Цикл
		
		Месяц         = ВыборкаМесяц.ПериодМесяц;
		Квартал       = НачалоКвартала(Месяц);
		Год           = НачалоГода(Месяц);
		СменаКвартала = (Квартал <> ТекКвартал);
		СменаГода     = (Год <> ТекГод);
		
		Если Не Начало Тогда
			
			Если СменаКвартала Тогда
				
				ТабДокумент.ЗакончитьГруппуСтрок();//Закончить группу "Квартал"
				ТабДокумент.Вывести(ОбластьКвартал);	
				
			КонецЕсли;
			
			Если СменаГода Тогда
				
				ТабДокумент.ЗакончитьГруппуСтрок();//Закончить группу "Год"
				ТабДокумент.Вывести(ОбластьГод);
				
			КонецЕсли;
			
			Если СменаКвартала Тогда
				
				Если СменаГода Тогда
					
					ТабДокумент.НачатьГруппуСтрок("Год");
					
				КонецЕсли;
				
				ТабДокумент.НачатьГруппуСтрок("Квартал");
				
			КонецЕсли;
			
		Иначе
			
			Начало = Ложь
			
		КонецЕсли;
				
		ТабДокумент.НачатьГруппуСтрок("Месяц");
		
		ВыборкаДень =  ВыборкаМесяц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДень.Следующий() Цикл
		
			ТабДокумент.НачатьГруппуСтрок("День");
			
			ВыборкаДокументы = ВыборкаДень.Выбрать();
			
			Пока ВыборкаДокументы.Следующий() Цикл
				
				ПараметрыСтрока.Заполнить(ВыборкаДокументы);
				ПараметрыСтрока.Статья4 = 0;
				ПараметрыСтрока.Статья7 = 0;
				
				// Заполнение вида дохода в колонке 8
				ВидДохода = "";
				Если ВыборкаДокументы.Статья = Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходыПоВидуДеятельностиНеУказанномуВСвидетельстве Тогда
					ВидДохода = "пп.2 п.293.4";
				ИначеЕсли ВыборкаДокументы.Статья = Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходыДругойСпособРасчетов Тогда
					ВидДохода = "пп.3 п.293.4";
				ИначеЕсли ВыборкаДокументы.Статья = Справочники.СтатьиНалоговыхДеклараций.ЕННК_ДоходыДоходыПоВидуДеятельностиНеЕдиныйНалог Тогда
					ВидДохода = "пп.4 п.293.4";
				КонецЕсли;
				ПараметрыСтрока.Статья8 = ВидДохода;
					
				ПараметрыСтрока.ДатаНомер = Формат(ВыборкаДокументы.Период, "ДФ=dd.MM.yyyy");
				ТабДокумент.Вывести(ОбластьСтрока);							
				
			КонецЦикла;
			
			ТабДокумент.ЗакончитьГруппуСтрок();//Закончить группу "День"
			ПараметрыДень.Заполнить(ВыборкаДень);
			День = ВыборкаДень.ПериодДень;
			ПараметрыДень.Итого = "Разом за " + Формат(День, "ДЛФ=D") + ":";
			ТабДокумент.Вывести(ОбластьДень);
		
		КонецЦикла;
		
		ТабДокумент.ЗакончитьГруппуСтрок();//Закончить группу "Месяц"
		ПараметрыМесяц.Заполнить(ВыборкаМесяц);
		Месяц = ВыборкаМесяц.ПериодМесяц;
		ПараметрыМесяц.Итого = "Разом за " + Формат(Месяц, "Л=uk_UA; ДФ='MMMM yyyy'") + ":";
	    ТабДокумент.Вывести(ОбластьМесяц);
		
		Если СменаКвартала Тогда
			
			ТекКвартал               = Квартал;
			ПараметрыКвартал.Итого   = "Наростаючим підсумком" + Символы.ПС + "за "
			                           + Формат(ТекКвартал,"ДФ=q") + " квартал "
			                           + Формат(ТекКвартал,"ДФ=yyyy") + " року:";
			ПараметрыКвартал.Статья2 = ВыборкаМесяц.Статья2;
			ПараметрыКвартал.Статья3 = ВыборкаМесяц.Статья3;
			ПараметрыКвартал.Статья4 = ВыборкаМесяц.Статья4;

			ПараметрыКвартал.Статья5 = ВыборкаМесяц.Статья5;
			ПараметрыКвартал.Статья6 = ВыборкаМесяц.Статья6;
			ПараметрыКвартал.Статья7 = ВыборкаМесяц.Статья7;
			ПараметрыКвартал.Статья9 = ВыборкаМесяц.Статья9;
			
		Иначе
			
			ПараметрыКвартал.Статья2 = ВыборкаМесяц.Статья2
			                           + ПараметрыКвартал.Статья2;
			ПараметрыКвартал.Статья3 = ВыборкаМесяц.Статья3
			                           + ПараметрыКвартал.Статья3;
			ПараметрыКвартал.Статья4 = ВыборкаМесяц.Статья4
			                           + ПараметрыКвартал.Статья4;
			ПараметрыКвартал.Статья5 = ВыборкаМесяц.Статья5
			                           + ПараметрыКвартал.Статья5;
			ПараметрыКвартал.Статья6 = ВыборкаМесяц.Статья6
			                           + ПараметрыКвартал.Статья6;
			ПараметрыКвартал.Статья7 = ВыборкаМесяц.Статья7
			                           + ПараметрыКвартал.Статья7;
			ПараметрыКвартал.Статья9 = ВыборкаМесяц.Статья9
			                           + ПараметрыКвартал.Статья9;
			
		КонецЕсли;
		
		
		Если СменаГода Тогда
			
			ТекГод               = Год;
			ПараметрыГод.Итого   = "Наростаючим підсумком" + Символы.ПС + "за " + Формат(ТекГод,"ДФ=yyyy") + " рік:";
			
			ПараметрыГод.Статья2 = ВыборкаМесяц.Статья2;
			ПараметрыГод.Статья3 = ВыборкаМесяц.Статья3;
			ПараметрыГод.Статья4 = ВыборкаМесяц.Статья4;
			ПараметрыГод.Статья5 = ВыборкаМесяц.Статья5;
			ПараметрыГод.Статья6 = ВыборкаМесяц.Статья6;
			ПараметрыГод.Статья7 = ВыборкаМесяц.Статья7;	
			ПараметрыГод.Статья9 = ВыборкаМесяц.Статья9;
			
		Иначе
			
			ПараметрыГод.Статья2 = ВыборкаМесяц.Статья2
			                       + ПараметрыГод.Статья2;
			ПараметрыГод.Статья3 = ВыборкаМесяц.Статья3
			                       + ПараметрыГод.Статья3;
			ПараметрыГод.Статья4 = ВыборкаМесяц.Статья4
			                       + ПараметрыГод.Статья4;
			ПараметрыГод.Статья5 = ВыборкаМесяц.Статья5
			                       + ПараметрыГод.Статья5;
			ПараметрыГод.Статья6 = ВыборкаМесяц.Статья6
			                       + ПараметрыГод.Статья6;
			ПараметрыГод.Статья7 = ВыборкаМесяц.Статья7
			                       + ПараметрыГод.Статья7;
			ПараметрыГод.Статья9 = ВыборкаМесяц.Статья9
			                       + ПараметрыГод.Статья9;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ТабДокумент.ЗакончитьГруппуСтрок();//Закончить группу "Квартал"
	ТабДокумент.Вывести(ОбластьКвартал);
	ТабДокумент.ЗакончитьГруппуСтрок();//Закончить группу "Год"
	ТабДокумент.Вывести(ОбластьГод);
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Если ПечатьПолногоОтчета Тогда
		ПоместитьВоВременноеХранилище(ТабДокумент, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры
